# Lets create a data frame first

In [2]:
import pandas as pd

In [57]:
data = [['Alex',10, 'US'],['Bob',12,'Canada'],['Clarke',13, 'UK'],['Ashish',13,'India'],['Alex',10, 'US'],['CC',15, 'US'],['BB',20, 'US'],['A',19, 'US']]
df = pd.DataFrame(data,columns=['Name','Age','Country'])

In [61]:
df

     Name  Age Country
0    Alex   10      US
1     Bob   12  Canada
2  Clarke   13      UK
3  Ashish   13   India
4    Alex   10      US
5      CC   15      US
6      BB   20      US
7       A   19      US

# Subset from data set "we are extracting all the data points where age >10"

In [59]:
df_subset = df['Age'] > 10

In [60]:
df[df_subset]

     Name  Age Country
1     Bob   12  Canada
2  Clarke   13      UK
3  Ashish   13   India
5      CC   15      US
6      BB   20      US
7       A   19      US

# Subset from data set "we are extracting data only for US"

In [65]:
df[df.Country == 'US']

   Name  Age Country
0  Alex   10      US
4  Alex   10      US
5    CC   15      US
6    BB   20      US
7     A   19      US

In [66]:
df[df.Age > 10]

     Name  Age Country
1     Bob   12  Canada
2  Clarke   13      UK
3  Ashish   13   India
5      CC   15      US
6      BB   20      US
7       A   19      US

reference : https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/